[
  {
    "title": "Junior Software Developer",
    "company": "Blackline Safety",
    "location": "Calgary, AB, CA",
    "dateString": "November 2020 - Present",
    "link": "https://www.blacklinesafety.com/",
    "details": [
      "Participating remotely in an Agile software development lifecycle which currently practices CI/CD and trunk based development.",
      "Used technologies including Python, Angular, and PHP to deliver features across several parts of the Blackline Safety SaaS platform.",
      "Updated and developed containerised applications in a Linux environment, which were deployed on the AWS platform.",
      "Developed features and fixed bugs to enable remote configuration of G7 EXO area gas monitors.",
      "Assisting in the transition from Python 2.7 to 3.8, fixing and identifying dependency and syntax incompatibilities.",
      "Contributing to the GDPR effort to isolate PII data to separate SQL databases in the European region.",
      "Mentored new hires and interns whenever possible to ease the transition into Blackline Safety."
    ],
    "color": "#9f2943"
  },
  {
    "title": "Software Developer Intern",
    "company": "Arterys",
    "location": "Calgary, AB, CA",
    "dateString": "May 2018 - July 2019",
    "link": "https://arterys.com/",
    "details": [
      "Participated in an Agile workflow as part of the Oncology product and Front-end architecture teams.",
      "Developed features and fixed bugs in the Arterys MICA platform, a SaaS product.",
      "Developed unit and integration tests for new features and bug fixes.",
      "Assisted in the transition from Angular.js to Vue.js by replacing Browserify with Webpack, migrating Angular.js directives to Vue components, and presenting an introduction to Vuex to developers.",
      "Reviewed and tested code for new features to ensure code and product quality was maintained.",
      "Mentored new interns, passing on knowledge to get them up to speed effectively."
    ],
    "color": "#1a1e33"
  },
  {
    "title": "Network Sustainment Intern",
    "company": "Shaw Communications",
    "location": "Calgary, AB, CA",
    "dateString": "January 2018 - April 2018",
    "link": "https://www.shaw.ca/",
    "details": [
      "Developed and tested front-end and back-end of a web app used to monitor the health of the Shaw cable plant.",
      "Improved performance of cable modem data collection by parallelizing the collection process.",
      "Simplified interface by introducing an interactive map giving an overview of cities, hubsites, and nodes.",
      "Updated and created SQL Server stored procedures to accommodate new features."
    ],
    "color": "#0082bb"
  }
]
