[
  {
    "title": "Software Developer",
    "company": "Clio",
    "location": "Calgary, AB, CA",
    "dateString": "April 2022 - Present",
    "link": "https://www.clio.com/",
    "details": [
      "Currently participating in an agile environment with a team of developers to solve complex problems and provide elegant solutions to Clio customers."
    ],
    "color": "#0069d1"
  },
  {
    "title": "Junior Software Developer",
    "company": "Blackline Safety",
    "location": "Calgary, AB, CA",
    "dateString": "November 2020 - February 2022",
    "link": "https://www.blacklinesafety.com/",
    "details": [
      "Participated in an Agile software development process using CI/CD and trunk based development.",
      "Delivered features across several parts of the Blackline Safety SaaS platform, including features for G7 EXO area gas monitors, utilizing technologies including Python, Angular, and PHP",
      "Coordinated communications between teams to ensure requirements are correctly updated and addressed while remaining on course to meet deadlines.",
      "Provided feedback during sprint planning and refinement to ensure requirements included relevant details and work required for a feature was identified.",
      "Updated and developed containerized applications in a Linux environment, which were deployed on the AWS platform.",
      "Mentored new hires and interns whenever possible, and created and updated onboarding documentation to ease the transition into the Blackline Safety development process.",
      "Developed features and fixed bugs to enable remote configuration of G7 EXO area gas monitors.",
      "Assisted in the transition from Python 2.7 to 3.8, fixing and identifying dependency and syntax incompatibilities.",
      "Contributed to the GDPR effort to isolate PII data to separate SQL databases in the European region.",
      "Participated in software developer interviews and provided feedback on potential hires to ensure team fit and development knowledge."
    ],
    "color": "#9f2943"
  },
  {
    "title": "Software Developer Intern",
    "company": "Arterys",
    "location": "Calgary, AB, CA",
    "dateString": "May 2018 - July 2019",
    "link": "https://arterys.com/",
    "details": [
      "Participated in a remote Agile workflow as part of the Oncology and Front-end architecture teams.",
      "Developed features and fixed bugs in the Arterys MICA platform, a SaaS product.",
      "Developed unit and integration tests for new features and bug fixes.",
      "Assisted in the transition from Angular.js to Vue.js by replacing Browserify with Webpack, migrating Angular.js directives to Vue components, and presenting an introduction to Vuex to developers.",
      "Reviewed and tested code for new features to ensure code and product quality was maintained.",
      "Mentored new interns, passing on knowledge to get them up to speed effectively."
    ],
    "color": "#131d39"
  },
  {
    "title": "Network Sustainment Intern",
    "company": "Shaw Communications",
    "location": "Calgary, AB, CA",
    "dateString": "January 2018 - April 2018",
    "link": "https://www.shaw.ca/",
    "details": [
      "Developed and tested front-end and back-end of a web app used to monitor the health of the Shaw cable plant.",
      "Parallelized the cable modem data collection shell script to improve performance.",
      "Simplified interface by introducing an interactive map giving an overview of cities, hubsites, and nodes.",
      "Updated and created SQL Server stored procedures to accommodate new features."
    ],
    "color": "#0082bb"
  }
]
